const attractions = [
  {
    id: 1,
    name: "ประตูท่าแพ",
    image: "../../modal/history/t1.jpg",
    content: "ประตูท่าแพเป็นหนึ่งในประตูเมืองเก่าของเชียงใหม่ สถานที่ยอดนิยมสำหรับนักท่องเที่ยวและเป็นจุดถ่ายรูปสำคัญ",
    travel: "ตั้งอยู่ใจกลางเมืองเชียงใหม่ สามารถเดินทางโดยรถสองแถวสีแดงหรือรถจักรยานยนต์",
  },
  {
    id: 2,
    name: "ดอยสุเทพ",
    image: "../../modal/history/t2.jpg",
    content: "วัดพระธาตุดอยสุเทพราชวรวิหารเป็นสถานที่ศักดิ์สิทธิ์ของเชียงใหม่ บรรยากาศสงบร่มเย็นพร้อมวิวเมืองเชียงใหม่ที่สวยงาม",
    travel: "สามารถเดินทางได้โดยรถสองแถวสีแดง หรือบริการเช่ารถจากในเมือง",
  },
  {
    id: 3,
    name: "พระตำหนักภูพิงคราชนิเวศน์",
    image: "../../modal/history/t3.jpeg",
    content: "พระตำหนักภูพิงคราชนิเวศน์เป็นพระตำหนักที่ใช้ในการเสด็จประทับของพระบรมวงศานุวงศ์ และมีสวนดอกไม้ที่สวยงาม",
    travel: "ตั้งอยู่ใกล้ดอยสุเทพ สามารถเดินทางต่อไปได้จากดอยสุเทพโดยรถสองแถวหรือรถเช่า",
  },
  {
    id: 4,
    name: "สวนสัตว์เชียงใหม่",
    image: "../../modal/history/t4.jpg",
    content: "สวนสัตว์เชียงใหม่เป็นสวนสัตว์ที่มีสัตว์หลากหลายชนิด รวมถึงแพนด้าชื่อดัง และมีกิจกรรมที่เหมาะสำหรับครอบครัว",
    travel: "ตั้งอยู่ใกล้กับทางขึ้นดอยสุเทพ สามารถเดินทางได้โดยรถสองแถวหรือรถส่วนตัว",
  },
  {
    id: 5,
    name: "ม่อนแจ่ม",
    image: "../../modal/history/t5.jpg",
    content: "ม่อนแจ่มเป็นจุดชมวิวบนดอยที่มีอากาศเย็นสบายตลอดปี มีทิวทัศน์ภูเขาและธรรมชาติที่งดงาม",
    travel: "เดินทางจากตัวเมืองเชียงใหม่ประมาณ 40 กิโลเมตร ใช้รถยนต์ส่วนตัวหรือเช่ารถ",
  },
];