const attractions = [
  {
    id: 1,
    name: "ประตูท่าแพ",
    image: "../../modal/history/t1.jpg",
    content: "ประตูท่าแพเป็นหนึ่งในประตูเมืองเก่าของเชียงใหม่ สถานที่ยอดนิยมสำหรับนักท่องเที่ยวและเป็นจุดถ่ายรูปสำคัญ",
    travel: "ตั้งอยู่ใจกลางเมืองเชียงใหม่ สามารถเดินทางโดยรถสองแถวสีแดงหรือรถจักรยานยนต์",
  },
  {
    id: 2,
    name: "ดอยสุเทพ",
    image: "../../modal/history/t2.jpg",
    content: "วัดพระธาตุดอยสุเทพราชวรวิหารเป็นสถานที่ศักดิ์สิทธิ์ของเชียงใหม่ บรรยากาศสงบร่มเย็นพร้อมวิวเมืองเชียงใหม่ที่สวยงาม",
    travel: "สามารถเดินทางได้โดยรถสองแถวสีแดง หรือบริการเช่ารถจากในเมือง",
  },
  {
    id: 3,
    name: "พระตำหนักภูพิงคราชนิเวศน์",
    image: "../../modal/history/t3.jpeg",
    content: "พระตำหนักภูพิงคราชนิเวศน์เป็นพระตำหนักที่ใช้ในการเสด็จประทับของพระบรมวงศานุวงศ์ และมีสวนดอกไม้ที่สวยงาม",
    travel: "ตั้งอยู่ใกล้ดอยสุเทพ สามารถเดินทางต่อไปได้จากดอยสุเทพโดยรถสองแถวหรือรถเช่า",
  },
  {
    id: 4,
    name: "สวนสัตว์เชียงใหม่",
    image: "../../modal/history/t4.jpg",
    content: `
              สวนสัตว์เชียงใหม่ ตั้งอยู่ที่เชิงดอยสุเทพ จังหวัดเชียงใหม่ เป็นหนึ่งในสถานที่ท่องเที่ยวสำคัญของภาคเหนือของประเทศไทย มีประวัติที่ยาวนานและน่าสนใจ ดังนี้:
              1. จุดเริ่มต้น  
                สวนสัตว์เชียงใหม่เริ่มต้นในปี พ.ศ. 2495 โดย "แฮโรลด์ เมสัน ยัง" (Harold Mason Young) ชาวอเมริกันที่อาศัยในเชียงใหม่ ซึ่งได้เลี้ยงสัตว์และเปิดพื้นที่ให้ชุมชนเข้าเยี่ยมชม ต่อมาในปี พ.ศ. 2510 สวนสัตว์แห่งนี้ได้รับการบริจาคให้แก่เทศบาลนครเชียงใหม่
              2. การจัดตั้งอย่างเป็นทางการ  
                ในปี พ.ศ. 2517 สวนสัตว์เชียงใหม่ได้ถูกโอนมาอยู่ภายใต้การดูแลขององค์การสวนสัตว์แห่งประเทศไทย (ปัจจุบันคือ องค์การสวนสัตว์แห่งประเทศไทยในพระบรมราชูปถัมภ์) และเริ่มพัฒนาพื้นที่อย่างจริงจัง
              3. สถานที่สำคัญและสัตว์เด่น  
                - สวนสัตว์เชียงใหม่มีพื้นที่กว่า 531 ไร่ เป็นบ้านของสัตว์หลากหลายสายพันธุ์ทั้งในประเทศและต่างประเทศ  
                - สถานที่ท่องเที่ยวที่โดดเด่น ได้แก่ หมีแพนด้าช่วงช่วงและหลินฮุ่ย ที่เป็นตัวแทนทางการทูตจากประเทศจีน รวมถึงอควาเรียมที่มีอุโมงค์ใต้น้ำยาวที่สุดในเอเชียตะวันออกเฉียงใต้
              4. บทบาทด้านการศึกษาและอนุรักษ์  
                สวนสัตว์เชียงใหม่มุ่งเน้นบทบาทในด้านการศึกษา การอนุรักษ์ และการเพาะพันธุ์สัตว์ที่ใกล้สูญพันธุ์ พร้อมทั้งส่งเสริมการท่องเที่ยวเชิงอนุรักษ์
              ปัจจุบัน สวนสัตว์เชียงใหม่ยังคงเป็นจุดหมายยอดนิยมสำหรับทั้งนักท่องเที่ยวไทยและต่างชาติ โดยเฉพาะอย่างยิ่งในช่วงฤดูหนาวที่บรรยากาศดีเป็นพิเศษ
            `,

    travel: "1.การเดินทางด้วยรถสาธารณะ รถสองแถวแดง",
  },
  {
    id: 5,
    name: "ม่อนแจ่ม",
    image: "../../modal/history/t5.jpg",
    content: "ม่อนแจ่มเป็นจุดชมวิวบนดอยที่มีอากาศเย็นสบายตลอดปี มีทิวทัศน์ภูเขาและธรรมชาติที่งดงาม",
    travel: "เดินทางจากตัวเมืองเชียงใหม่ประมาณ 40 กิโลเมตร ใช้รถยนต์ส่วนตัวหรือเช่ารถ",
  },
];